# trusting-social-Python-assignment

Use the "Run" button to execute the code.

In [1]:
print('Hello World')

Hello World

In [6]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [7]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.1-py2.py3-none-any.whl (249 kB)
     |████████████████████████████████| 249 kB 6.0 MB/s
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.1
Note: you may need to restart the kernel to use updated packages.

In [8]:
messy = pd.read_excel("messy.xlsx", sheet_name ="test")

In [9]:
messy.head(5)

,CUst ID,JOIN% DATE,Unnamed: 2,mobiles,FLL NAM
0,1,08/07/19,NaN,84333605993,mIChAel mIcHALek
1,2,09/10/18,NaN,973444062,Andrew Jimenez
2,3,20190630,NaN,338262954,Ann Gow
3,4,2019-09-06 00:00:1567702800,NaN,84966068026,James Chen
4,5,20170812,NaN,84767065885,Dollie Martinez

In [10]:
messy[messy.duplicated(['CUst ID'], keep=False)]

,CUst ID,JOIN% DATE,Unnamed: 2,mobiles,FLL NAM
5,21,2018-06-02 00:00:1527872400,NaN,84339769174,Roger Callender
8,9,2018-12-01 00:00:1543597200,NaN,782904001,JaMeS dEmERs
13,14,20171210,NaN,84356173988,Paul Ruper
20,21,30/08/17,NaN,841227138894,aNGiE DavIS
23,24,04/04/19,NaN,84766048406,juaNIta nutTer
24,97,09/02/19,NaN,84978909747,Stephanie Short
32,33,20190723,NaN,974404339,Lawrence Cummings
33,9,2017-10-21 00:00:1508518800,NaN,1285210195,Shelby Dexter
40,41,01/01/19,NaN,1267025689,Elizabeth Herrington
46,33,20180627,NaN,841221912612,John Lowe
47,14,29/11/17,NaN,841224205265,Vincent Shone
57,24,2018-06-05 00:00:1528131600,NaN,84341879989,Janet Doughty
59,41,2018-03-25 00:00:1521910800,NaN,84963807157,lenny arNEtt
65,66,12/09/19,NaN,84869366677,Florence Luallen
68,69,20180918,NaN,1289086592,sHARon HarRIS
72,86,20190611,NaN,865639641,Yvette Hayden
76,66,20180728,NaN,344944845,Dora Bowser
81,69,2018-06-02 00:00:1527872400,NaN,841267978866,Lamont Baucom
85,86,30/09/17,NaN,334998639,James Wendel
96,97,2017-08-22 00:00:1503334800,NaN,84972812359,Daniel Bentley

In [17]:
#Clean the names of columns to lowercase separated by “_”, remove any empty column if necessary.
## Checking number of rows and columns

messy.shape

## checking for missing values
messy.isnull().sum()

## we have an empty column Unnamed:2. All 100 values missing. Removing the column
#messy = messy.drop("Unnamed: 2", axis=1)

CUst ID         0
  JOIN% DATE    0
mobiles         0
  FLL NAM       0
dtype: int64

In [18]:
## validating
messy.head(3)

   CUst ID   JOIN% DATE      mobiles           FLL NAM
0        1     08/07/19  84333605993  mIChAel mIcHALek
1        2     09/10/18    973444062    Andrew Jimenez
2        3     20190630    338262954           Ann Gow

In [19]:
messy.columns

Index(['CUst ID', '  JOIN% DATE', 'mobiles', '  FLL NAM'], dtype='object')

In [20]:
## Removing special characters, whitespaces and renaming column names as specified

messy.columns = messy.columns.str.replace("%","")
messy.columns = messy.columns.str.lstrip()
messy.rename(columns={'CUst ID':'cust_id','JOIN DATE':'join_date','FLL NAM':'fll_nam'}, inplace=True)

In [21]:
## Validating

messy.columns

Index(['cust_id', 'join_date', 'mobiles', 'fll_nam'], dtype='object')

In [22]:
#Change the date column to the same format ‘YYYY-MM-DD’.

messy['join_date']=pd.to_datetime(messy['join_date'],errors='coerce')
unique=pd.to_datetime(messy['join_date'], format='%Y-%m-%d %H:%M:%S%f',errors='coerce').dt.strftime('%Y-%m-%d')
messy.loc[messy['join_date'].isnull(),'join_date']=unique
messy['join_date']=pd.to_datetime(messy['join_date'],errors='coerce')

In [23]:
messy.head()

   cust_id  join_date      mobiles           fll_nam
0        1 2019-08-07  84333605993  mIChAel mIcHALek
1        2 2018-09-10    973444062    Andrew Jimenez
2        3 2019-06-30    338262954           Ann Gow
3        4        NaT  84966068026        James Chen
4        5 2017-08-12  84767065885   Dollie Martinez

In [24]:
#Change the name column to the title case (e.g: Jason Mraz).
## changing all letters to lowercase

messy['fll_nam']=messy['fll_nam'].str.lower()

In [25]:
## changing first letter of each word i.e first & last name to uppercase

messy['fill_nam'] = messy.fll_nam.str.title()

In [26]:
## Validating

messy['fill_nam']

0     Michael Michalek
1       Andrew Jimenez
2              Ann Gow
3           James Chen
4      Dollie Martinez
            ...
95      Ron Grollimund
96      Daniel Bentley
97        Eugene Brown
98        Elmer Miller
99     Frances Holland
Name: fill_nam, Length: 100, dtype: object

In [27]:
#Make a new “email” column with form: {last_name}.{first_name}.{id}@yourcompany.com

## Changing cust_id to string type

messy['cust_id']=messy['cust_id'].astype(str)

In [28]:
## creating eamil using str.replace method

messy['email'] = messy.fll_nam.str.replace('\s+', '.') + '.'+ messy.cust_id+ '@yourcompany.com'

/tmp/ipykernel_37/2613052363.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  messy['email'] = messy.fll_nam.str.replace('\s+', '.') + '.'+ messy.cust_id+ '@yourcompany.com'

In [29]:
## dropping extra fll_nam column with lower case details

messy = messy.drop(messy.columns[3],axis=1)

In [30]:
messy.head(5)

,cust_id,join_date,mobiles,fill_nam,email
0,1,2019-08-07,84333605993,Michael Michalek,michael.michalek.1@yourcompany.com
1,2,2018-09-10,973444062,Andrew Jimenez,andrew.jimenez.2@yourcompany.com
2,3,2019-06-30,338262954,Ann Gow,ann.gow.3@yourcompany.com
3,4,NaT,84966068026,James Chen,james.chen.4@yourcompany.com
4,5,2017-08-12,84767065885,Dollie Martinez,dollie.martinez.5@yourcompany.com

In [31]:
#Change the phone number column to the format “84……”
messy['mobiles'] = messy['mobiles'].astype(str)

In [32]:
messy['mobiles'] = messy['mobiles'].str.replace('+', '')
messy.loc[~messy['mobiles'].str.startswith('84'), 'mobiles'] = '84' + messy[~messy['mobiles'].str.startswith('84')]['mobiles']

/tmp/ipykernel_37/334546401.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  messy['mobiles'] = messy['mobiles'].str.replace('+', '')

In [33]:
messy.head(5)

,cust_id,join_date,mobiles,fill_nam,email
0,1,2019-08-07,84333605993,Michael Michalek,michael.michalek.1@yourcompany.com
1,2,2018-09-10,84973444062,Andrew Jimenez,andrew.jimenez.2@yourcompany.com
2,3,2019-06-30,84338262954,Ann Gow,ann.gow.3@yourcompany.com
3,4,NaT,84966068026,James Chen,james.chen.4@yourcompany.com
4,5,2017-08-12,84767065885,Dollie Martinez,dollie.martinez.5@yourcompany.com

In [34]:
#Find any duplicated ID and remove those who join later.

## Sorting by join date desecending and then dropping the duplicate values by keeping the highest date

messy = messy.sort_values(by='join_date', ascending=False)
messy = messy.drop_duplicates(subset='cust_id', keep="first")

In [35]:
## Validating . As identified earlier the data had 10 pairs of duplicate rows, dropped 10 rows.

messy.shape

(90, 5)

In [37]:
#Filter those who join since 2019 and export to a csv file, delimited by “|”, file name “emp_{report_date}.csv” with report_date = today.

## Filtering data

filter_df = messy[(messy['join_date']> "2019-01-01")]

In [38]:
# Validating

filter_df['join_date']

65   2019-12-09
91   2019-11-05
10   2019-10-07
19   2019-09-23
24   2019-09-02
99   2019-08-22
73   2019-08-19
95   2019-08-16
0    2019-08-07
82   2019-07-28
32   2019-07-23
2    2019-06-30
98   2019-06-12
72   2019-06-11
94   2019-06-08
31   2019-06-06
62   2019-06-01
41   2019-05-21
69   2019-05-18
77   2019-04-21
23   2019-04-04
51   2019-01-23
6    2019-01-05
Name: join_date, dtype: datetime64[ns]

In [39]:
filter_df.to_csv('clean_data.csv',sep ='|',index=False)